# LayerModifier Class

---
A modifier used to designate extra strings to appear in the exported layer name.
SystemObject Autodesk.Revit.DBLayerModifier
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class LayerModifier : IDisposable

    Public Class LayerModifier
    	Implements IDisposable

    public ref class LayerModifier : IDisposable

    type LayerModifier =
        class
            interface IDisposable
        end
The LayerModifier type exposes the following members.
| Name| Description
---|---|---
| LayerModifier|  Constructs a new LayerModifier with default values.
| LayerModifier(ModifierType, String)|  Constructs a new LayerModifier with modifierType and separator.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| ModifierType|  The modifier type of LayerModifier.
| Separator|  The separator string that will follow this modifier in the export layer name.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the LayerModifier
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
A modifier consists of a type (from ModifierType and an optional separator. Apply a modifier to one or more ExportLayerInfo objects to modify the layer name that will be assigned when a Revit object is exported.
#### Reference
Autodesk.Revit.DB Namespace